app/Models/CurdModel.php

UPDATE `login_history` SET `last_activity_time` = '2023-04-14 17:23:19'
WHERE `id` = 199
---
        public function update_session(){
      $session = session()->get('adminlogin');
            $q = $this->db->table('login_history')->where(array('id'=>$session['login_id']))->set(array('last_activity_time'=>date('Y-m-d H:i:s')))->update();